quarkus/runc_benchmark_results.log
Running 1m test @ http://localhost:8080/fruits
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    1.96ms  37.41ms   90.68%
    Req/Sec   387.28    175.19     0.86k    63.00%
  23153 requests in 1.00m, 1.59MB read
Requests/sec:    385.48
Transfer/sec:     27.10KB
Running 1m test @ http://localhost:8080/fruits
  5 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.24ms    3.47ms  97.81ms   94.89%
    Req/Sec   347.29     74.65   505.00     66.73%
  103817 requests in 1.00m, 7.13MB read
Requests/sec:   1728.27
Transfer/sec:    121.52KB
Running 1m test @ http://localhost:8080/fruits
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.78ms    5.20ms 133.99ms   90.37%
    Req/Sec   197.64     56.06   363.00     67.59%
  118219 requests in 1.00m, 8.12MB read
Requests/sec:   1967.30
Transfer/sec:    138.33KB
Running 1m test @ http://localhost:8080/fruits
  15 threads and 15 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.99ms    4.56ms  77.17ms   77.34%
    Req/Sec   151.19     27.15   270.00     66.62%
  135705 requests in 1.00m, 9.32MB read
Requests/sec:   2259.23
Transfer/sec:    158.85KB
Running 1m test @ http://localhost:8080/fruits
  20 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.18ms    6.23ms  76.79ms   72.39%
    Req/Sec   115.84     25.55   232.00     66.97%
  138634 requests in 1.00m, 9.52MB read
Requests/sec:   2307.51
Transfer/sec:    162.25KB
Running 1m test @ http://localhost:8080/fruits
  25 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.01ms    9.20ms 118.31ms   74.68%
    Req/Sec    91.24     26.58   303.00     67.00%
  136620 requests in 1.00m, 9.38MB read
Requests/sec:   2273.80
Transfer/sec:    159.88KB
Running 1m test @ http://localhost:8080/fruits
  30 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.15ms   10.89ms 111.39ms   70.94%
    Req/Sec    77.37     24.30   200.00     70.19%
  139131 requests in 1.00m, 9.55MB read
Requests/sec:   2315.87
Transfer/sec:    162.83KB
Running 1m test @ http://localhost:8080/fruits
  35 threads and 35 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.59ms   14.70ms 159.29ms   74.89%
    Req/Sec    63.97     24.33   212.00     72.26%
  134199 requests in 1.00m, 9.21MB read
Requests/sec:   2234.02
Transfer/sec:    157.08KB
Running 1m test @ http://localhost:8080/fruits
  40 threads and 40 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.48ms   15.90ms 224.57ms   77.88%
    Req/Sec    57.37     22.12   171.00     65.51%
  137568 requests in 1.00m, 9.45MB read
Requests/sec:   2289.90
Transfer/sec:    161.01KB